historic/HGST_HMS5C4040AL_btrfs_raid1x2_4TB/randread-004-8k.fio.out
randread-8k: (g=0): rw=randread, bs=8K-8K/8K-8K/8K-8K, ioengine=libaio, iodepth=10
fio-2.2.8
Starting 1 process

randread-8k: (groupid=0, jobs=1): err= 0: pid=2663: Wed Apr  6 20:45:01 2016
  read : io=147888KB, bw=2462.1KB/s, iops=307, runt= 60046msec
    slat (usec): min=5, max=47, avg= 8.32, stdev= 2.01
    clat (usec): min=62, max=466810, avg=32465.44, stdev=34020.04
     lat (usec): min=69, max=466818, avg=32473.85, stdev=34020.04
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    6], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[   13], 40.00th=[   16], 50.00th=[   21], 60.00th=[   26],
     | 70.00th=[   36], 80.00th=[   49], 90.00th=[   75], 95.00th=[  102],
     | 99.00th=[  161], 99.50th=[  192], 99.90th=[  258], 99.95th=[  277],
     | 99.99th=[  379]
    bw (KB  /s): min= 2096, max= 2800, per=100.00%, avg=2465.03, stdev=120.50
    lat (usec) : 100=0.01%, 500=0.39%, 750=0.03%, 1000=0.01%
    lat (msec) : 2=0.02%, 4=0.30%, 10=20.63%, 20=28.05%, 50=31.14%
    lat (msec) : 100=14.25%, 250=5.04%, 500=0.14%
  cpu          : usr=0.11%, sys=0.29%, ctx=18489, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=18486/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: io=147888KB, aggrb=2462KB/s, minb=2462KB/s, maxb=2462KB/s, mint=60046msec, maxt=60046msec